In [1]:
import pandas as pd

df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two'],
                   'C' : [1, 5, 5, 2, 5, 5],
                   'D' : [2.0, 5., 8., 1., 2., 9.]})
grouped = df.groupby('A')[['C', 'D']]

E:\Python\Anaconda\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
E:\Python\Anaconda\lib\site-packages\numpy\.libs\libopenblas.4SP5SUA7CBGXUEOC35YP2ASOICYYEQZZ.gfortran-win_amd64.dll
E:\Python\Anaconda\lib\site-packages\numpy\.libs\libopenblas64__v0.3.21-gcc_10_3_0.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

In [18]:
pd.DataFrame(grouped)

     0                                        1
0  bar     C    D
1  5  5.0
3  2  1.0
5  5  9.0
1  foo     C    D
0  1  2.0
2  5  8.0
4  5  2.0

In [19]:
grouped.transform('min')

   C    D
0  1  2.0
1  2  1.0
2  1  2.0
3  2  1.0
4  1  2.0
5  2  1.0

In [3]:

grouped.agg(kol_a = pd.NamedAgg(column='C', aggfunc='min'),
            kol_b = pd.NamedAgg(column='D', aggfunc=lambda x: x.max()-x.min())
            )

     kol_a  kol_b
A
bar      2    8.0
foo      1    6.0